|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|

Напишите программу, которая из строки слов, записанных через пробел, выбирает только слова, в которых есть повторяющиеся буквы в любом регистре, и выводит их по одному в строке в обратном алфавитном порядке.

Используйте _filter()_.

## Пример

|Ввод|Вывод|
|---|---|
|Then my eyes meet yours once more|meet<br>eyes|


def alpha(a):
    lst = []
    for item in a:
        if a.lower().count(item) > 1:
            lst.append(item)
    return lst


strings = input().split()
print(*sorted(filter(alpha, strings), reverse=True), sep='\n')