|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|

Напишите программу, которая считывает строку слов, записанных через пробел, и выводит каждое слово с новой строки в лексикографическом порядке, преобразовав все гласные буквы в верхний регистр, а согласные в нижний.

В задаче обязательно использовать преобразование с помощью _map()_.

## Пример

|Ввод|Вывод|
|---|---|
|Madness of world locked away|AwAY<br>Of<br>lOckEd<br>mAdnEss<br>wOrld|

def register(a):
    lst = []
    vowels = 'aeyuio'
    for item in a:
        if item in vowels:
            lst.append(item.upper())
        else:
            lst.append(item.lower())
    return ''.join(lst)


a = input().split()
print(*sorted(map(register, a)), sep='\n')