|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|

Напишите программу, которая из введённой строки выберет только слова, которые лексикографически больше первого слова строки без учёта регистра и меньше последнего также без учёта регистра.

Слова в строке записаны через пробел.

Выводите отобранные слова так же через пробел в исходном порядке.

## Пример

|Ввод|Вывод|
|---|---|
|Calm as a river Tranquility in my heart Blue summer skies reign|in my heart|

line = input().lower().split()
first, *other, end = line
lst1 = [word for word in other if first < word < end]
print(*lst1)