|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|
|Ввод|стандартный ввод или input.txt|
|Вывод|стандартный вывод или result.txt|

Из всех введённых чисел выберите те, что имеют такую же чётность, как их общая сумма.

## Формат ввода

Вводятся строки чисел, записанных через пробел.

## Формат вывода

В файл **result.txt** запишите все выбранные числа в порядке неубывания по одному в строке.

## Пример

| Ввод                                        | Вывод                                           |
| ------------------------------------------- | ----------------------------------------------- |
| 6 12 31 9 7 18<br>5 13 8 6<br>199 6 17 5 31 | 5<br>5<br>7<br>9<br>13<br>17<br>31<br>31<br>199 |

input_file = open('input.txt')
result_file = open('result.txt', 'w')
all_numbers = []
for line in input_file:
    all_numbers.extend(map(int, line.split()))
number_sum = round(sum(all_numbers), 0)
if number_sum % 2 == 0:
    finish_number = filter(lambda x: x % 2 == 0, all_numbers)
else:
    finish_number = filter(lambda x: x % 2 != 0, all_numbers)
result_num = sorted(finish_number)
print(*result_num, sep='\n', file=result_file)