|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|
|Ввод|стандартный ввод или input.txt|
|Вывод|стандартный вывод или strings.txt|

Наведите порядок в файлах: соберите из них все строки и расставьте заданным способом.

## Формат ввода

Вводятся несколько имён файлов.

## Формат вывода

Прочитайте все строки, которые записаны в этих файлах. Запишите их в файл **strings.txt** сначала в порядке уменьшения длины, а в случае одинаковой длины — в алфавитном порядке.

## Пример

|Ввод|Вывод|
|---|---|
|song.txt<br>poem.txt|Twinkle, twinkle, little star,<br>Up above the world so high,<br>He can play hide-and-seek.<br>How I wonder what you are.<br>Like a diamond in the sky.<br>He runs for a rat<br>His name is Nick<br>Watch the cat!|

## Примечания

В примере используются файлы:  
**song.txt**  
Watch the cat!  
He runs for a rat  
His name is Nick  
He can play hide-and-seek.

и **poem.txt**  
Twinkle, twinkle, little star,  
How I wonder what you are.  
Up above the world so high,  
Like a diamond in the sky.
from sys import stdin


line = stdin.readlines()
line1 = [x.strip() for x in line]
lst_result = []
for item in line1:
    with open(item, encoding='utf-8') as dil:
        lst_1 = [x.strip() for x in dil]
        lst_result.extend(lst_1)
with (open('strings.txt', 'w', encoding='utf-8') as strings):
    result = sorted(lst_result, key=lambda x: (-len(x), x))
    print(*result, sep='\n', file=strings)