|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|
|Ввод|стандартный ввод или road.csv|
|Вывод|стандартный вывод или report.txt|

Для контроля скорости движения автомобилей применяется следующая технология: две камеры, установленные на некотором расстоянии друг от друга (в этой задаче расстояние равно **5 км**), фиксируют время прохождения автомобиля в секундах с начала суток. Затем рассчитывается средняя скорость движения и сравнивается с допустимой (на данном участке **90 км/ч**).

Напишите программу, которая определит автомобили, нарушающие скоростной режим.

В файле **road.csv** записаны результаты измерений в формате (разделители — запятые):  
_номер автомобиля, время первой камеры, время второй камеры_  
_no, time1, time2_

В файл **report.txt** запишите номера всех автомобилей, скорость которых превысила допустимую, в порядке размещения в файле.

## Пример

|Ввод|Вывод|
|---|---|
|no,time1,time2<br>У601ХР,18170,18416<br>В327АМ,2981,3162<br>В443ОР,48237,48449<br>Н868МО,33671,33861<br>В736СЕ,49284,49467<br>У951КВ,74482,74695<br>Е144ХХ,24315,24499<br>О605ВЕ,35537,35721<br>С759ВС,42342,42573<br>Е285МН,25460,25687<br>А692НМ,5321,5521<br>О537МВ,75944,76192<br>Н064ОК,20216,20440<br>Р836ТС,46418,46632|В327АМ<br>Н868МО<br>В736СЕ<br>Е144ХХ<br>О605ВЕ|

## Примечания

В примере ввода и вывода показано содержимое файлов. Используйте кодировку, номера автомобилей содержат кириллические буквы.

import csv


with (open('road.csv', encoding='utf-8') as file,
      open('report.txt', 'w', encoding='utf-8') as result):
    reader = csv.DictReader(file, delimiter=',')
    lst = []
    for item in reader:
        time = int(item['time2']) - int(item['time1'])
        speed = (5 / time) * 3600
        if speed > 90:
            lst.append(item['no'])
    print(*lst, sep='\n', file=result)