|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|
|Ввод|стандартный ввод или zoo.csv|
|Вывод|стандартный вывод или output.txt|

В файле **zoo.csv** записана информация о некоторых животных зоопарка в формате (разделители — запятые):  
_номер, кличка, вид животного, возраст, вольер_  
_no, name, mode, age, aviary_

Напишите программу, которая проведёт инвентаризацию каждого вольера, то есть создаст словарь, в котором по ключу — вольеру — записаны списки строк вида:  
_<вид> <кличка>, <возраст>_  
в алфавитном порядке.

Выведите полученный словарь.

## Пример

|Ввод|Вывод|
|---|---|
|no,name,mode,age,aviary<br>1,Bubblegum,fox,3,A2<br>2,Vitsli-Putsli,fox,9,A2<br>3,Freya,fox,9,A1<br>4,Kesha,fox,2,A2<br>5,Honey,capybara,0,D2<br>6,Scarlett,capybara,8,D1<br>7,Kuzma,capybara,8,D2<br>8,Malaya,capybara,7,D2<br>9,Alice,capybara,1,D1<br>10,Isabella,yak,3,A1<br>11,Zlata,yak,8,B2<br>12,Gayane,crane,3,B2<br>13,Korean,crane,3,A1<br>14,Nogawa,crane,0,B2|{'A2': ['fox Bubblegum, 3', 'fox Kesha, 2', 'fox Vitsli-Putsli, 9'],<br> 'A1': ['crane Korean, 3', 'fox Freya, 9', 'yak Isabella, 3'],<br> 'D2': ['capybara Honey, 0', 'capybara Kuzma, 8', 'capybara Malaya, 7'],<br> 'D1': ['capybara Alice, 1', 'capybara Scarlett, 8'],<br> 'B2': ['crane Gayane, 3', 'crane Nogawa, 0', 'yak Zlata, 8']}|

## Примечания

В примере ввода показано содержимое файла _zoo.csv_.

import csv
from pprint import pprint


with open('zoo.csv') as file:
    reader = csv.DictReader(file, delimiter=',')
    dic = {}
    for item in reader:
        mode = item['mode']
        name = item['name']
        age = item['age']
        dic[item['aviary']] = dic.get(item['aviary'], []) + [f'{mode} {name}, {age}']
        dic[item['aviary']].sort()
    pprint(dic, sort_dicts=False)