|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64 Мб|
|Ввод|стандартный ввод или sunspots.csv|
|Вывод|стандартный вывод или result.txt|

Активность Солнца может измеряться количеством пятен на его поверхности и описываться числом Вольфа (по имени астронома Рудольфа Вольфа).

В файле **sunspots.csv** представлены данные о числе Вольфа, определённом для данной даты разными источниками (спутниками Солнца, находящимися в разных точках орбиты, и наземными телескопами), разделители — точки.

_id записи, дата, число Вольфа, источник_  
_id, date, number, source_

Напишите программу, которая по этим данным определит дни с наименьшей и наибольшей солнечной активностью, в случае одинаковой — первый подходящий день. Запишите найденные две даты в файл **result.txt**.

## Пример

|Ввод|Вывод|
|---|---|
|id.date.number.source<br>1.2015/07/01.35.EF590<br>2.2015/04/22.38.HX609<br>3.2015/11/26.37.TN643<br>4.2015/05/21.32.ZU569<br>5.2015/07/23.2.QJ908<br>6.2015/09/04.40.PP234<br>7.2015/07/10.6.EU695<br>8.2015/08/06.35.EE152<br>9.2015/07/05.17.AX989<br>10.2015/09/18.16.KT859<br>11.2015/06/03.19.OI512<br>12.2015/01/28.1.CO355|2015/01/28<br>2015/09/04|

## Примечания

В примере ввода и вывода показано содержимое файлов.

import csv


with (open('sunspots.csv', encoding='utf-8') as file,
      open('result.txt', 'w', encoding='utf-8') as result):
    reader = csv.DictReader(file, delimiter='.')
    dic = {}
    for item in reader:
        dic[item['date']] = dic.get(item['date'], []) + [int(item['number'])]
    print(min(dic, key=dic.get), file=result)
    print(max(dic, key=dic.get), file=result)