При чтении файла не забывайте, что файл — это итератор, поэтому прочитать его можно только один раз. Если вам нужно пользоваться данными из файла несколько раз — запишите их в переменную.

Прочитать текстовый файл можно также несколькими способами:

- прочитать весь файл целиком в одну строку:

```python
f = open('example.txt')
s = f.read()
print(s)
s1 = f.read()
print(s1)
```

При выводе образовалось слишком много пустых строк.

Сможете объяснить почему?

Первая пустая строка была в файле (символ перевода строки в конце).

Затем функция print() по умолчанию заканчивается переводом строки — это вторая пустая строка.

Затем мы попытались прочитать файл — итератор, — а он уже пуст, поэтому ничего выведено не было, а print() снова перевёл нас на одну строку.

- прочитать одну строку из файла (затем следующую, потом ещё, весь файл можно читать построчно (каждая строка заканчивается переводом строки, который сохранился при чтении, поэтому столько пустых строк при выводе):

```python
f = open('example.txt')
s = f.readline()
print(s)
s1 = f.readline()
print(s1)
```

Или в цикле (а здесь мы отрезали перевод строки, лишних пустых строк не стало):

```python
f = open('example.txt')
for _ in range(2):
    s = f.readline().rstrip()
    print(s)
```

- или прочитать все строки файла в список строк:

```python
f = open('example.txt')
s = f.readlines()
print(s)
# ['123\n', '345\n']
```

Здесь чётко виден оставшийся перевод строки, но его можно отрезать в списочном выражении или через map():

```python
s = [x.rstrip() for x in f.readlines()]
print(s)
# ['123', '345']
```

Если в файле были числа и мы хотим преобразовать тип, то int() преобразует даже с символом перевода строки, обрезать его не обязательно:

```python
s = map(int, f.readlines())
print(*s)
# 123 345
```

Кому-то нравится работать с файлами просто как со строками средствами _Python_. Например, они читают файл в строку, а затем сплитят по переводу строки. Если такое действие сочетается с неверно созданным файлом примера (без перевода строки в конце), то могут возникнуть ошибки в тестировании решения на корректно созданных файлах.

Судите сами: вот пример работы с файлом без пустой строки в конце средствами _Python_ для работы со строками и для работы с файлами (разницы никакой, только не читайте один файл два раза, второй раз не получится, там уже ничего нет):

```python
s = f.read().split('\n')
s = [x.rstrip() for x in f.readlines()]
print(s)
# ['123', '345']
```

А вот что получится, если файл был создан корректно, с переводом строки в конце:

```python
s = [x.rstrip() for x in f.readlines()]
print(s)
# ['123', '345']


s = f.read().split('\n')
print(s)
# ['123', '345', '']
```

Видите разницу? Поэтому

**Так делать неправильно:**

```python
s = f.read().split('\n')
```

**А так — правильно:**

```python
s = [x.rstrip() for x in f.readlines()]
```

или

```python
s = map(str.rstrip, f.readlines())
```

Чтение файла очень похоже на чтение потока ввода sys.stdin. Так и должно быть, ведь поток ввода — это тоже файл.

## Пример решения задачи

При компьютерном сбое все строки скороговорки, записанной в файле twister.txt, перевернулись задом наперёд. Напишите программу, чтобы прочитать строки из файла и вернуть их в исходный вид.

_Пример содержимого файла twister.txt:_

```python
акнещ авД
екещ к акещ
уктёщ тюлпищ
.еклогу в
```

_Решение_

Поскольку в файле находится кириллический текст, при открытии нужно указать кодировку (Юникод можно обозначать разными способами: utf8, UTF-8, utf-8, как угодно). Откроем файл:

```python
f = open('twister.txt', encoding='utf-8')
```

Прочитаем строки, отрезая у каждой перевод строки:

```python
lines = map(str.rstrip, f.readlines())
```

Перевернём каждую и выведем:

```python
for line in lines:
    print(line.rstrip()[::-1])
```

А если вспомнить, что файл — это итератор, то решить задачу можно проще:

```python
f = open('twister.txt', encoding='utf-8')

for line in f:
    print(line.rstrip()[::-1])
```

_Вывод:_

```python
Два щенка
щека к щеке
щиплют щётку
в уголке.
```